app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('i', '-6140814980.542430385914835', '2010-10-26 02:00:20', '2010-10-26 02:00:20', '105bdb03f95af234af7cf3be74290a8a0eeda6d9')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save